ThunderSloth/kirb-3/source/Kirb-3-MSPM0G3507/kirb-3.syscfg
UART2.$name                            = "UART_DEBUG";
UART2.targetBaudRate                   = 115200;
UART2.peripheral.rxPin.$assign         = "boosterpack.33";
UART2.peripheral.txPin.$assign         = "boosterpack.34";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric19";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric20";

VREF.basicExtVolt           = 3.3;
VREF.basicIntVolt           = "DL_VREF_BUFCONFIG_OUTPUT_2_5V";
VREF.peripheral.$assign     = "VREF";
VREF.vrefPosPinConfig.$name = "ti_driverlib_gpio_GPIOPinGeneric17";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
pinFunction4.peripheral.$suggestSolution           = "SYSCTL";
pinFunction4.peripheral.hfxInPin.$suggestSolution  = "j17_expansion.4";
pinFunction4.peripheral.hfxOutPin.$suggestSolution = "j17_expansion.5";
ADC121.peripheral.$suggestSolution                 = "ADC0";
Board.peripheral.$suggestSolution                  = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution         = "j25_expansion.16";
Board.peripheral.swdioPin.$suggestSolution         = "j25_expansion.14";
CAPTURE1.peripheral.ccp3Pin.$suggestSolution       = "boosterpack.2";
GPIO5.associatedPins[0].pin.$suggestSolution       = "boosterpack.35";
I2C1.peripheral.$suggestSolution                   = "I2C1";
QEI1.peripheral.$suggestSolution                   = "TIMG8";
SPI1.peripheral.$suggestSolution                   = "SPI1";
TIMER1.peripheral.$suggestSolution                 = "TIMG6";
UART1.peripheral.$suggestSolution                  = "UART1";
UART2.peripheral.$suggestSolution                  = "UART0";
VREF.peripheral.vrefPosPin.$suggestSolution        = "j17_expansion.10";
